espressif/esp-idf/components/soc/esp32c6/register/soc/sdio_slc_host_struct.h
/** Type of conf_w1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf4 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf4:8;
        /** slchost_conf5 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf5:8;
        /** slchost_conf6 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf6:8;
        /** slchost_conf7 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf7:8;
    };
    uint32_t val;
} slchost_conf_w1_reg_t;

/** Type of conf_w2 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf8 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf8:8;
        /** slchost_conf9 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf9:8;
        /** slchost_conf10 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf10:8;
        /** slchost_conf11 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf11:8;
    };
    uint32_t val;
} slchost_conf_w2_reg_t;

/** Type of conf_w3 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf12 : R/W; bitpos: [7:0]; default: 192;
         *  *******Description***********
         */
        uint32_t slchost_conf12:8;
        /** slchost_conf13 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf13:8;
        /** slchost_conf14 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf14:8;
        /** slchost_conf15 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf15:8;
    };
    uint32_t val;
} slchost_conf_w3_reg_t;

/** Type of conf_w4 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf16 : R/W; bitpos: [7:0]; default: 255;
         *  *******Description***********
         */
        uint32_t slchost_conf16:8;
        /** slchost_conf17 : R/W; bitpos: [15:8]; default: 1;
         *  *******Description***********
         */
        uint32_t slchost_conf17:8;
        /** slchost_conf18 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf18:8;
        /** slchost_conf19 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf19:8;
    };
    uint32_t val;
} slchost_conf_w4_reg_t;

/** Type of conf_w5 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf20 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf20:8;
        /** slchost_conf21 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf21:8;
        /** slchost_conf22 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf22:8;
        /** slchost_conf23 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf23:8;
    };
    uint32_t val;
} slchost_conf_w5_reg_t;

/** Type of win_cmd register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_win_cmd : R/W; bitpos: [15:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_win_cmd:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} slchost_win_cmd_reg_t;

/** Type of conf_w6 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf24 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf24:8;
        /** slchost_conf25 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf25:8;
        /** slchost_conf26 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf26:8;
        /** slchost_conf27 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf27:8;
    };
    uint32_t val;
} slchost_conf_w6_reg_t;

/** Type of conf_w7 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf28 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf28:8;
        /** slchost_conf29 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf29:8;
        /** slchost_conf30 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf30:8;
        /** slchost_conf31 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf31:8;
    };
    uint32_t val;
} slchost_conf_w7_reg_t;

/** Type of pkt_len0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** hostslchost_slc0_len0 : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len0:20;
        /** hostslchost_slc0_len0_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len0_check:12;
    };
    uint32_t val;
} slchost_pkt_len0_reg_t;

/** Type of pkt_len1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** hostslchost_slc0_len1 : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len1:20;
        /** hostslchost_slc0_len1_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len1_check:12;
    };
    uint32_t val;
} slchost_pkt_len1_reg_t;

/** Type of pkt_len2 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** hostslchost_slc0_len2 : RO; bitpos: [19:0]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len2:20;
        /** hostslchost_slc0_len2_check : RO; bitpos: [31:20]; default: 0;
         *  *******Description***********
         */
        uint32_t hostslchost_slc0_len2_check:12;
    };
    uint32_t val;
} slchost_pkt_len2_reg_t;

/** Type of conf_w8 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_conf32 : R/W; bitpos: [7:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf32:8;
        /** slchost_conf33 : R/W; bitpos: [15:8]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf33:8;
        /** slchost_conf34 : R/W; bitpos: [23:16]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf34:8;
        /** slchost_conf35 : R/W; bitpos: [31:24]; default: 0;
         *  *******Description***********
         */
        uint32_t slchost_conf35:8;
    };
    uint32_t val;
} slchost_conf_w8_reg_t;

