espressif/esp-idf/components/soc/esp32c6/register/soc/sdio_slc_host_struct.h
/** Type of slc_apbwin_conf register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc_apbwin_addr : R/W; bitpos: [27:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc_apbwin_addr:28;
        /** slc_apbwin_wr : R/W; bitpos: [28]; default: 0;
         *  *******Description***********
         */
        uint32_t slc_apbwin_wr:1;
        /** slc_apbwin_start : R/W/SC; bitpos: [29]; default: 0;
         *  *******Description***********
         */
        uint32_t slc_apbwin_start:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} slchost_slc_apbwin_conf_reg_t;

/** Type of slc_apbwin_rdata register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc_apbwin_rdata : RO; bitpos: [31:0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc_apbwin_rdata:32;
    };
    uint32_t val;
} slchost_slc_apbwin_rdata_reg_t;

/** Type of rdclr0 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc0_bit7_clraddr : R/W; bitpos: [8:0]; default: 68;
         *  *******Description***********
         */
        uint32_t slchost_slc0_bit7_clraddr:9;
        /** slchost_slc0_bit6_clraddr : R/W; bitpos: [17:9]; default: 480;
         *  *******Description***********
         */
        uint32_t slchost_slc0_bit6_clraddr:9;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} slchost_rdclr0_reg_t;

/** Type of rdclr1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_slc1_bit7_clraddr : R/W; bitpos: [8:0]; default: 480;
         *  *******Description***********
         */
        uint32_t slchost_slc1_bit7_clraddr:9;
        /** slchost_slc1_bit6_clraddr : R/W; bitpos: [17:9]; default: 480;
         *  *******Description***********
         */
        uint32_t slchost_slc1_bit6_clraddr:9;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} slchost_rdclr1_reg_t;

/** Type of slc0host_int_ena1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc0_tohost_bit0_int_ena1 : R/W; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit0_int_ena1:1;
        /** slc0_tohost_bit1_int_ena1 : R/W; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit1_int_ena1:1;
        /** slc0_tohost_bit2_int_ena1 : R/W; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit2_int_ena1:1;
        /** slc0_tohost_bit3_int_ena1 : R/W; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit3_int_ena1:1;
        /** slc0_tohost_bit4_int_ena1 : R/W; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit4_int_ena1:1;
        /** slc0_tohost_bit5_int_ena1 : R/W; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit5_int_ena1:1;
        /** slc0_tohost_bit6_int_ena1 : R/W; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit6_int_ena1:1;
        /** slc0_tohost_bit7_int_ena1 : R/W; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tohost_bit7_int_ena1:1;
        /** slc0_token0_1to0_int_ena1 : R/W; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_1to0_int_ena1:1;
        /** slc0_token1_1to0_int_ena1 : R/W; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_1to0_int_ena1:1;
        /** slc0_token0_0to1_int_ena1 : R/W; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token0_0to1_int_ena1:1;
        /** slc0_token1_0to1_int_ena1 : R/W; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_token1_0to1_int_ena1:1;
        /** slc0host_rx_sof_int_ena1 : R/W; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_sof_int_ena1:1;
        /** slc0host_rx_eof_int_ena1 : R/W; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_eof_int_ena1:1;
        /** slc0host_rx_start_int_ena1 : R/W; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_rx_start_int_ena1:1;
        /** slc0host_tx_start_int_ena1 : R/W; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0host_tx_start_int_ena1:1;
        /** slc0_rx_udf_int_ena1 : R/W; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_udf_int_ena1:1;
        /** slc0_tx_ovf_int_ena1 : R/W; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_tx_ovf_int_ena1:1;
        /** slc0_rx_pf_valid_int_ena1 : R/W; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_pf_valid_int_ena1:1;
        /** slc0_ext_bit0_int_ena1 : R/W; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit0_int_ena1:1;
        /** slc0_ext_bit1_int_ena1 : R/W; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit1_int_ena1:1;
        /** slc0_ext_bit2_int_ena1 : R/W; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit2_int_ena1:1;
        /** slc0_ext_bit3_int_ena1 : R/W; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_ext_bit3_int_ena1:1;
        /** slc0_rx_new_packet_int_ena1 : R/W; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_rx_new_packet_int_ena1:1;
        /** slc0_host_rd_retry_int_ena1 : R/W; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc0_host_rd_retry_int_ena1:1;
        /** gpio_sdio_int_ena1 : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t gpio_sdio_int_ena1:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc0host_int_ena1_reg_t;

