espressif/esp-idf/components/soc/esp32c6/register/soc/sdio_slc_host_struct.h
/** Type of slc1host_int_ena1 register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slc1_tohost_bit0_int_ena1 : R/W; bitpos: [0]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit0_int_ena1:1;
        /** slc1_tohost_bit1_int_ena1 : R/W; bitpos: [1]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit1_int_ena1:1;
        /** slc1_tohost_bit2_int_ena1 : R/W; bitpos: [2]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit2_int_ena1:1;
        /** slc1_tohost_bit3_int_ena1 : R/W; bitpos: [3]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit3_int_ena1:1;
        /** slc1_tohost_bit4_int_ena1 : R/W; bitpos: [4]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit4_int_ena1:1;
        /** slc1_tohost_bit5_int_ena1 : R/W; bitpos: [5]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit5_int_ena1:1;
        /** slc1_tohost_bit6_int_ena1 : R/W; bitpos: [6]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit6_int_ena1:1;
        /** slc1_tohost_bit7_int_ena1 : R/W; bitpos: [7]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tohost_bit7_int_ena1:1;
        /** slc1_token0_1to0_int_ena1 : R/W; bitpos: [8]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_1to0_int_ena1:1;
        /** slc1_token1_1to0_int_ena1 : R/W; bitpos: [9]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_1to0_int_ena1:1;
        /** slc1_token0_0to1_int_ena1 : R/W; bitpos: [10]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token0_0to1_int_ena1:1;
        /** slc1_token1_0to1_int_ena1 : R/W; bitpos: [11]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_token1_0to1_int_ena1:1;
        /** slc1host_rx_sof_int_ena1 : R/W; bitpos: [12]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_sof_int_ena1:1;
        /** slc1host_rx_eof_int_ena1 : R/W; bitpos: [13]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_eof_int_ena1:1;
        /** slc1host_rx_start_int_ena1 : R/W; bitpos: [14]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_rx_start_int_ena1:1;
        /** slc1host_tx_start_int_ena1 : R/W; bitpos: [15]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1host_tx_start_int_ena1:1;
        /** slc1_rx_udf_int_ena1 : R/W; bitpos: [16]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_udf_int_ena1:1;
        /** slc1_tx_ovf_int_ena1 : R/W; bitpos: [17]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_tx_ovf_int_ena1:1;
        /** slc1_rx_pf_valid_int_ena1 : R/W; bitpos: [18]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_rx_pf_valid_int_ena1:1;
        /** slc1_ext_bit0_int_ena1 : R/W; bitpos: [19]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit0_int_ena1:1;
        /** slc1_ext_bit1_int_ena1 : R/W; bitpos: [20]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit1_int_ena1:1;
        /** slc1_ext_bit2_int_ena1 : R/W; bitpos: [21]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit2_int_ena1:1;
        /** slc1_ext_bit3_int_ena1 : R/W; bitpos: [22]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_ext_bit3_int_ena1:1;
        /** slc1_wifi_rx_new_packet_int_ena1 : R/W; bitpos: [23]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_wifi_rx_new_packet_int_ena1:1;
        /** slc1_host_rd_retry_int_ena1 : R/W; bitpos: [24]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_host_rd_retry_int_ena1:1;
        /** slc1_bt_rx_new_packet_int_ena1 : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t slc1_bt_rx_new_packet_int_ena1:1;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} slchost_slc1host_int_ena1_reg_t;

/** Type of slchostdate register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_date : R/W; bitpos: [31:0]; default: 554043136;
         *  *******Description***********
         */
        uint32_t slchost_date:32;
    };
    uint32_t val;
} slchost_slchostdate_reg_t;

/** Type of slchostid register
 *  *******Description***********
 */
typedef union {
    struct {
        /** slchost_id : R/W; bitpos: [31:0]; default: 1536;
         *  *******Description***********
         */
        uint32_t slchost_id:32;
    };
    uint32_t val;
} slchost_slchostid_reg_t;

/** Type of conf register
 *  *******Description***********
 */
typedef union {
    struct {
        /** frc_sdio11 : R/W; bitpos: [4:0]; default: 0;
         *  *******Description***********
         */
        uint32_t frc_sdio11:5;
        /** frc_sdio20 : R/W; bitpos: [9:5]; default: 0;
         *  *******Description***********
         */
        uint32_t frc_sdio20:5;
        /** frc_neg_samp : R/W; bitpos: [14:10]; default: 0;
         *  *******Description***********
         */
        uint32_t frc_neg_samp:5;
        /** frc_pos_samp : R/W; bitpos: [19:15]; default: 0;
         *  *******Description***********
         */
        uint32_t frc_pos_samp:5;
        /** frc_quick_in : R/W; bitpos: [24:20]; default: 0;
         *  *******Description***********
         */
        uint32_t frc_quick_in:5;
        /** sdio20_int_delay : R/W; bitpos: [25]; default: 0;
         *  *******Description***********
         */
        uint32_t sdio20_int_delay:1;
        /** sdio_pad_pullup : R/W; bitpos: [26]; default: 0;
         *  *******Description***********
         */
        uint32_t sdio_pad_pullup:1;
        /** hspeed_con_en : R/W; bitpos: [27]; default: 0;
         *  *******Description***********
         */
        uint32_t hspeed_con_en:1;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} slchost_conf_reg_t;

